software/caTissue/modules/caTissueStaticDataService/test/SOAP-XMLs/InsertOrderDetailsWithExistingSpecimenOrderItem.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <InsertRequest xmlns="http://wapi.wustl.edu/WAPI">
            <object>
                <ns1:AbstractDomainObject comment="Comments: SOAP UI"
                                          identifier="0"
                                          name="Order name 55"
                                          requestedDate="2011-08-15T21:47:58.725Z"
                                          status="New"
                                          xsi:type="ns2:OrderDetails"
                                          xmlns:ns1="gme://caCORE.caCORE/3.2/edu.wustl.common.domain.ws"
                                          xmlns:ns2="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.ws">
                    <ns2:distributionProtocol>
                        <ns2:DistributionProtocol identifier="6"/>
                    </ns2:distributionProtocol>

                    <ns2:orderItemCollection>
                        <ns2:OrderItem identifier="0"
                                       requestedQuantity="9.8"
                                       status="New"
                                       xsi:type="ns2:ExistingSpecimenOrderItem">
                                <ns2:specimen>
                                    <ns2:Specimen identifier="9" xsi:type="ns2:Specimen"/>
	                        </ns2:specimen>
                        </ns2:OrderItem>
                    </ns2:orderItemCollection>
                </ns1:AbstractDomainObject>
            </object>
        </InsertRequest>
    </soapenv:Body>
</soapenv:Envelope>